readme enhanced
